用字符画美化一下命令提示符窗口

一直以为prompt就只能显示单行字符串，但$_代表换行，
所以可以使用【字符画】来美化一下单调的命令提示符窗口：

#!usr.bin/perl

use strict;

use warnings;

my $prompt="";
while(<DATA>){
s/&/\$A/g;      # &符号替换为$A
s/\|/\$B/g;     # 管道符号替换为$B
s/\(/\$C/g;     # 左括号替换为$C
s/\)/\$F/g;     # 右括号替换为$F
s/>/\$G/g;      # 大于号替换为$G
s/</\$L/g;      # 小于号替换为$L
s/=/\$Q/g;      # 等号替换为$Q
s/ /\$S/g;      # 空格替换为$S
s/　/\$S\$S/g;  # 中文空格替换为两个英文空格
s/\n/\$_/g;     # 换行符替换为$_
s/\^/^^/g;      # 单个^替换为2个^^
$prompt .= $_;
}
system("cmd /k prompt $prompt");
# 直接用system(prompt $prompt)不行
__DATA__
　　　　\.　-　 -　.
　　　 ' \　 情　 _ , -`.
　　 '　　\　　_,'　　 _,'
　　'　　　,-'　　　_/
　 ' 爱 ,-' \　　 _/
　'　 ,'　　 \　_'
　'　'　　　 _\
　' ,　　_,-'　\
　\,_,--'　　　 \
——————————————————————————————————————————

